app/controllers/school_classes_controller.rb

  def create
    @schoolclass = SchoolClass.create(params.require(:school_class).permit(:title, :room_number))
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Designing"], ["room_number", 202], ["created_at", "2019-06-10 16:41:00.404834"], ["updated_at", "2019-06-10 16:41:00.404834"]]

  def update
    @schoolclass = SchoolClass.find(params[:id])
    @schoolclass.update(params.require(:school_class).permit(:title, :room_number))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2019-06-10 11:58:11.710017"], ["id", 1]]